{
    "common": {
        "name": "mydlink",
        "version": "1.0.5",
        "news": {
            "1.0.5": {
                "en": "* Fixed possible issue with device ids.\r\n* Improved device creation\r\n* Adjusted for discovery adapter that not yet stores passwords encrypted.",
                "de": "* Mögliches Problem mit Geräte-IDs behoben.\r\n* Verbesserte Geräteerstellung\r\n* Angepasst für den Erkennungsadapter, der noch keine verschlüsselten Passwörter speichert.",
                "ru": "* Исправлена возможная проблема с идентификаторами устройств.\r\n* Улучшено создание устройства\r\n* С учетом адаптера обнаружения, который еще не хранит зашифрованные пароли.",
                "pt": "* Corrigido possível problema com os IDs do dispositivo.\r\n* Melhor criação de dispositivos\r\n* Ajustado para o adaptador de descoberta que ainda não armazena senhas criptografadas.",
                "nl": "* Mogelijk probleem met apparaat-ID's opgelost.\r\n* Verbeterde apparaatcreatie\r\n* Aangepast voor zoekadapter die wachtwoorden nog niet versleuteld opslaat.",
                "fr": "* Correction d'un problème possible avec les identifiants des appareils.\r\n* Amélioration de la création d'appareils\r\n* Adapté pour l'adaptateur de découverte qui ne stocke pas encore les mots de passe cryptés.",
                "it": "* Risolto possibile problema con ID dispositivo.\r\n* Creazione del dispositivo migliorata\r\n* Modificato per l'adattatore di individuazione che non memorizza ancora le password crittografate.",
                "es": "* Se corrigió un posible problema con los identificadores del dispositivo.\r\n* Creación mejorada de dispositivos\r\n* Ajustado para el adaptador de descubrimiento que aún no almacena contraseñas cifradas.",
                "pl": "* Naprawiono możliwy problem z identyfikatorami urządzeń.\r\n* Ulepszone tworzenie urządzeń\r\n* Dostosowano do adaptera wykrywania, który nie przechowuje jeszcze zaszyfrowanych haseł.",
                "zh-cn": "*修复了设备ID可能出现的问题。\r\n*改进的设备创建\r\n*针对尚未存储加密密码的发现适配器进行了调整。"
            },
            "1.0.4": {
                "en": "* Improved connection keepAlive\r\n* Improved logging of network errors",
                "de": "* Verbesserte Verbindung keepAlive\r\n* Verbesserte Protokollierung von Netzwerkfehlern",
                "ru": "* Улучшено соединение keepAlive\r\n* Улучшено ведение журнала сетевых ошибок",
                "pt": "* Conexão aprimorada keepAlive\r\n* Registro aprimorado de erros de rede",
                "nl": "* Verbeterde verbinding keepAlive\r\n* Verbeterde logging van netwerkfouten",
                "fr": "* Connexion améliorée keepAlive\r\n* Amélioration de la journalisation des erreurs réseau",
                "it": "* Connessione migliorata keepAlive\r\n* Registrazione degli errori di rete migliorata",
                "es": "* Conexión mejorada keepAlive\r\n* Registro mejorado de errores de red",
                "pl": "* Ulepszone połączenie keepAlive\r\n* Ulepszone rejestrowanie błędów sieciowych",
                "zh-cn": "*改进的连接keepAlive\r\n*改进的网络错误记录"
            },
            "1.0.3": {
                "en": "* Fixed login/identification loop on (possibly) duplicate devices",
                "de": "* Anmelde- / Identifikationsschleife bei (möglicherweise) doppelten Geräten behoben",
                "ru": "* Исправлена ошибка входа / идентификации на (возможно) дублирующих устройствах",
                "pt": "* Corrigido loop de login / identificação em (possivelmente) dispositivos duplicados",
                "nl": "* Vaste login / identificatielus op (mogelijk) dubbele apparaten",
                "fr": "* Boucle de connexion / identification fixe sur (éventuellement) les appareils en double",
                "it": "* Corretto il loop di login / identificazione su dispositivi (possibilmente) duplicati",
                "es": "* Se corrigió el bucle de inicio de sesión / identificación en (posiblemente) dispositivos duplicados",
                "pl": "* Naprawiono pętlę logowania / identyfikacji na (ewentualnie) zduplikowanych urządzeniach",
                "zh-cn": "*修复（可能）重复设备上的登录/标识循环"
            },
            "1.0.2": {
                "en": "* Fixed potential crashes on network errors.",
                "de": "* Mögliche Abstürze bei Netzwerkfehlern behoben.",
                "ru": "* Исправлены возможные сбои при сетевых ошибках.",
                "pt": "* Corrigidas falhas potenciais em erros de rede.",
                "nl": "* Mogelijke crashes bij netwerkfouten opgelost.",
                "fr": "* Correction de plantages potentiels sur les erreurs de réseau.",
                "it": "* Risolti potenziali arresti anomali su errori di rete.",
                "es": "* Se corrigieron posibles bloqueos en los errores de red.",
                "pl": "* Naprawiono potencjalne awarie błędów sieci.",
                "zh-cn": "*修复了因网络错误而导致的潜在崩溃。"
            },
            "1.0.1": {
                "en": "* Re-added device config to adapter config (in case objects get deleted).",
                "de": "* Die Gerätekonfiguration wurde erneut zur Adapterkonfiguration hinzugefügt (falls Objekte gelöscht werden).",
                "ru": "* Повторно добавлена конфигурация устройства в конфигурацию адаптера (на случай, если объекты будут удалены).",
                "pt": "* Adicionou novamente a configuração do dispositivo à configuração do adaptador (caso os objetos sejam excluídos).",
                "nl": "* Apparaatconfiguratie opnieuw toegevoegd aan adapterconfiguratie (voor het geval objecten worden verwijderd).",
                "fr": "* Ajout de la configuration du périphérique à la configuration de l'adaptateur (au cas où les objets seraient supprimés).",
                "it": "* Re-aggiunto la configurazione del dispositivo alla configurazione dell'adattatore (nel caso in cui gli oggetti vengano eliminati).",
                "es": "* Se volvió a agregar la configuración del dispositivo a la configuración del adaptador (en caso de que los objetos se eliminen).",
                "pl": "* Ponownie dodano konfigurację urządzenia do konfiguracji adaptera (w przypadku usunięcia obiektów).",
                "zh-cn": "*将设备配置重新添加到适配器配置（以防对象被删除）。"
            },
            "1.0.0": {
                "en": "* BREAKING CHANGE: device id is now mac instead of name -> all devices need to be recreated. Sorry for that. But should never happen again, now. New devices *should* be created automatically.\r\n* added encryption of PIN\r\n* settings stored in native part of device (please do not delete them or you have to reconfigure them)\r\n* modified device creation / identification / start to allow devices to be (re-)started during runtime (you do not need to press save on config page anymore)\r\n* added auto detection\r\n* added missing translations\r\n* added sentry plugin (including sending information about unknown devices)\r\n* a lot of internal restructuring and cleanup for better maintenance in future.",
                "de": "* BREAKING CHANGE: Geräte-ID ist jetzt Mac anstelle von Name -> Alle Geräte müssen neu erstellt werden. Das tut mir leid. Sollte aber jetzt nie wieder passieren. Neue Geräte *sollten* automatisch erstellt werden. \n* Verschlüsselung der PIN hinzugefügt\r\n* Einstellungen, die im nativen Teil des Geräts gespeichert sind (bitte löschen Sie sie nicht oder Sie müssen sie neu konfigurieren)\r\n* Die Erstellung / Identifizierung / der Start von Geräten wurde geändert, damit Geräte zur Laufzeit (neu) gestartet werden können (Sie müssen auf der Konfigurationsseite nicht mehr auf Speichern klicken).\r\n* Automatische Erkennung hinzugefügt\r\n* fehlende Übersetzungen hinzugefügt\r\n* Sentry Plugin hinzugefügt (einschließlich Senden von Informationen über unbekannte Geräte)\r\n* viele interne Umstrukturierungen und Aufräumarbeiten für eine bessere Wartung in der Zukunft.",
                "ru": "* BREAKING CHANGE: идентификатор устройства теперь mac вместо имени -> все устройства должны быть воссозданы. Простите за это. Но никогда не должно повториться, сейчас. Новые устройства *должны* создаваться автоматически. \n* добавлено шифрование PIN\r\n* настройки хранятся в исходной части устройства (пожалуйста, не удаляйте их, или вы должны перенастроить их)\r\n* изменено создание / идентификация / запуск устройства, чтобы разрешить (пере) запускать устройства во время выполнения (вам больше не нужно нажимать кнопку Сохранить на странице конфигурации)\r\n* добавлено автоопределение\r\n* добавлены недостающие переводы\r\n* добавлен плагин sentry (включая отправку информации о неизвестных устройствах)\r\n* много внутренней реструктуризации и очистки для лучшего обслуживания в будущем.",
                "pt": "* BREAKING CHANGE: o ID do dispositivo agora é mac em vez de nome -> todos os dispositivos precisam ser recriados. Desculpe por isso. Mas nunca deve acontecer novamente agora. Novos dispositivos *devem* ser criados automaticamente. \n* criptografia adicionada do PIN\r\n* configurações armazenadas na parte nativa do dispositivo (não as exclua ou você deve reconfigurá-las)\r\n* criação / identificação / início de dispositivo modificado para permitir que os dispositivos sejam (re) iniciados durante o tempo de execução (você não precisa mais pressionar salvar na página de configuração)\r\n* detecção automática adicionada\r\n* traduções ausentes adicionadas\r\n* plugin de sentinela adicionado (incluindo o envio de informações sobre dispositivos desconhecidos)\r\n* Muita reestruturação interna e limpeza para melhor manutenção no futuro.",
                "nl": "* BREAKING CHANGE: apparaat-ID is nu mac in plaats van naam -> alle apparaten moeten opnieuw worden gemaakt. Sorry daarvoor. Maar mag nu nooit meer gebeuren. Nieuwe apparaten *moeten* automatisch worden gemaakt. \n* toegevoegde encryptie van PIN\r\n* instellingen opgeslagen in het native deel van het apparaat (verwijder ze alstublieft niet of u moet ze opnieuw configureren)\r\n* gewijzigde apparaatcreatie / identificatie / start zodat apparaten tijdens runtime kunnen worden (opnieuw) gestart (u hoeft niet meer op opslaan op de configuratiepagina te drukken)\r\n* toegevoegde automatische detectie\r\n* ontbrekende vertalingen toegevoegd\r\n* toegevoegde sentry-plug-in (inclusief het verzenden van informatie over onbekende apparaten)\r\n* veel interne herstructurering en opruiming voor beter onderhoud in de toekomst.",
                "fr": "* BREAKING CHANGE: l'identifiant de l'appareil est désormais mac au lieu du nom -> tous les appareils doivent être recréés. Désolé. Mais cela ne devrait plus jamais se reproduire, maintenant. Les nouveaux appareils *devraient* être créés automatiquement. \n* cryptage ajouté du code PIN\r\n* paramètres stockés dans la partie native de l'appareil (veuillez ne pas les supprimer ou vous devez les reconfigurer)\r\n* création / identification / démarrage des appareils modifiés pour permettre aux appareils d'être (re) démarrés pendant l'exécution (vous n'avez plus besoin d'appuyer sur enregistrer sur la page de configuration)\r\n* détection automatique ajoutée\r\n* ajout de traductions manquantes\r\n* ajout d'un plugin sentinelle (y compris l'envoi d'informations sur des appareils inconnus)\r\n* beaucoup de restructuration interne et de nettoyage pour une meilleure maintenance à l'avenir.",
                "it": "* MODIFICA DI ROTTURA: l'ID del dispositivo ora è mac anziché nome -> è necessario ricreare tutti i dispositivi. Scusa per quella cosa. Ma non dovrebbe mai succedere più, ora. I nuovi dispositivi *dovrebbero* essere creati automaticamente. \n* aggiunta la crittografia del PIN\r\n* impostazioni memorizzate nella parte nativa del dispositivo (per favore non cancellarle o devi riconfigurarle)\r\n* creazione / identificazione / avvio dei dispositivi modificati per consentire ai dispositivi di essere (ri) avviati durante l'esecuzione (non è più necessario premere Salva sulla pagina di configurazione)\r\n* aggiunto rilevamento automatico\r\n* aggiunte traduzioni mancanti\r\n* aggiunto plugin sentinella (incluso l'invio di informazioni su dispositivi sconosciuti)\r\n* molta ristrutturazione interna e pulizia per una migliore manutenzione in futuro.",
                "es": "* BREAKING CHANGE: la identificación del dispositivo ahora es mac en lugar de nombre -> todos los dispositivos necesitan ser recreados. Lo siento por eso. Pero nunca debería volver a suceder, ahora. Los nuevos dispositivos *deberían* crearse automáticamente. \n* cifrado agregado de PIN\r\n* configuraciones almacenadas en la parte nativa del dispositivo (no las elimine o debe reconfigurarlas)\r\n* Se modificó la creación / identificación / inicio del dispositivo para permitir que los dispositivos se (reinicien) durante el tiempo de ejecución (ya no es necesario presionar guardar en la página de configuración)\r\n* detección automática agregada\r\n* se agregaron traducciones faltantes\r\n* Complemento de centinela agregado (incluido el envío de información sobre dispositivos desconocidos)\r\n* mucha reestructuración interna y limpieza para un mejor mantenimiento en el futuro.",
                "pl": "* ZŁAMANIE ZMIANY: identyfikator urządzenia to teraz mac zamiast nazwy -> wszystkie urządzenia muszą zostać odtworzone. Przepraszam za to. Ale teraz już nigdy nie powinno się to powtórzyć. Nowe urządzenia *powinny* zostać utworzone automatycznie. \n* dodano szyfrowanie PIN\r\n* ustawienia przechowywane w natywnej części urządzenia (proszę nie usuwać ich lub trzeba je ponownie skonfigurować)\r\n* zmodyfikowano tworzenie / identyfikację / uruchomienie urządzenia, aby umożliwić (ponowne) uruchomienie urządzeń podczas działania (nie trzeba już naciskać przycisku Zapisz na stronie konfiguracji)\r\n* dodano automatyczne wykrywanie\r\n* dodano brakujące tłumaczenia\r\n* dodano wtyczkę sentry (w tym wysyłanie informacji o nieznanych urządzeniach)\r\n* dużo wewnętrznej restrukturyzacji i czyszczenia dla lepszej konserwacji w przyszłości.",
                "zh-cn": "*变更更改：设备ID现在是mac，而不是名称->需要重新创建所有设备。抱歉但是现在不应该再发生。 *应*自动创建新设备。\r\n*添加了PIN加密\r\n*设置存储在设备的本机部分中（请不要删除它们，否则必须重新配置）\r\n*修改了设备的创建/识别/启动，以允许在运行时（重新）启动设备（您无需再在配置页面上按保存）\r\n*增加了自动检测\r\n*添加了缺少的翻译\r\n*添加了哨兵插件（包括发送有关未知设备的信息）\r\n*进行了大量内部重组和清理工作，以便将来进行更好的维护。"
            },
            "0.0.7": {
                "en": "added info.connection state, silenced repeated error messages",
                "de": "info.connection state hinzugefügt, wiederholte Fehlermeldungen unterdrückt"
            },
            "0.0.6": {
                "en": "prevent removement of custom details in objects",
                "de": "verhindere, dass eingestellte details an Objekten überschrieben werden"
            },
            "0.0.5": {
                "en": "fixed config files for release in latest repository.",
                "de": "Konfigurationsdateien für eine Veröffentlichung im repository aufgeräumt"
            },
            "0.0.4": {
                "en": "added pollInterval option on per device basis.\nadded no_motion field to motion sensors.",
                "de": "poll interval kann jetzt für jedes Gerät einzeln festgelegt werden.\nneues no_motion feld für Bewegungsmelder."
            },
            "0.0.3": {
                "en": "use setStateChanged instead of polling state before writing,\nminor clean ups.",
                "de": "Interne Optimierungen."
            },
            "0.0.2": {
                "en": "moved to iobroker-community-adapters",
                "de": "zu iobroker-community-adapters umgezogen"
            },
            "0.0.1": {
                "en": "first test version ",
                "de": "erste test version "
            }
        },
        "title": "mydlink",
        "titleLang": {
            "en": "mydlink",
            "de": "mydlink"
        },
        "desc": {
            "en": "connects mydlink plugs and sensors to ioBroker",
            "de": "verbindet mydlink Steckdosen und Sensoren mit ioBroker"
        },
        "authors": [
            "Garfonso <garfonso@mobo.info>"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "mydlink.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.mydlink/master/admin/mydlink.png",
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.mydlink/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "hardware",
        "connectionType": "local",
        "dataSource": "poll",
        "keywords": [
            "mydlink",
            "dsp-w215"
        ],
        "compact": true,
        "materialize": true,
        "supportCustoms": false,
        "messagebox": true,
        "dependencies": [
            {
                "js-controller": ">=1.5.11"
            }
        ],
        "plugins": {
            "sentry": {
                "dsn": "https://f3bd9039fcf9447a97efcc52d8f8b349@o377092.ingest.sentry.io/5198728",
                "pathWhitelist": [
                    "@iobroker",
                    "iobroker.js-controller",
                    "mydlink",
                    "soapclient",
                    "deviceFlags"
                ],
                "pathBlacklist": [],
                "errorBlacklist": [
                    "SyntaxError"
                ]
            }
        }
    },
    "native": {
        "devices": []
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "connection status to wifi determined by at least one device responding",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}